In [28]:
import pandas as pd # memasukan data kedalam data dataFrame
import numpy as np # digunakan untuk perhitungan
import seaborn as sns # implemetasi
import matplotlib.pyplot as plt #implementasi

%matplotlib inline
sns.set(color_codes=True)

In [29]:
df = pd.read_csv("data_car.csv")
df.head(10) # untuk mendisplay top 5 data dari atas

       Pembuat Model mobil  tahun perilisan harga saat ini     HP
0          BMW          M1             2011       $50,000    10.0
1          BMW          M2             2015       $70,000    15.0
2  LAMBORGHINI        HEAT             2010       $60,000    15.0
3  LAMBORGHINI      RUMBLE             2015       $80,000    10.0
4  LAMBORGHINI        RONE             2000       $50,000    10.0
5  LAMBORGHINI        RONE             2000       $50,000   100.0
6          BMW         GTR             2015            NaN   15.0

In [30]:
df.tail(3) # untuk mendisplay top 3 data dari bawah

       Pembuat Model mobil  tahun perilisan harga saat ini     HP
4  LAMBORGHINI        RONE             2000       $50,000    10.0
5  LAMBORGHINI        RONE             2000       $50,000   100.0
6          BMW         GTR             2015            NaN   15.0

In [31]:
df.dtypes # melihat type isi dari atribute

Pembuat             object
Model mobil         object
tahun perilisan      int64
harga saat ini      object
HP                 float64
dtype: object

In [32]:
df = df.rename(columns={
    'Pembuat' : 'merek',
    'Model mobil' : 'model',
    'tahun perilisan' : 'tahun',
    'harga saat ini' : 'harga'
})
# mengubah nama atribute
df.head(10)

         merek   model  tahun     harga     HP
0          BMW      M1   2011  $50,000    10.0
1          BMW      M2   2015  $70,000    15.0
2  LAMBORGHINI    HEAT   2010  $60,000    15.0
3  LAMBORGHINI  RUMBLE   2015  $80,000    10.0
4  LAMBORGHINI    RONE   2000  $50,000    10.0
5  LAMBORGHINI    RONE   2000  $50,000   100.0
6          BMW     GTR   2015       NaN   15.0

In [33]:
df.shape # meg show banyak nya rows, column

(7, 5)

In [34]:
duplicate_rows_df = df[df.duplicated()] # mengcopy df yang punya nilai sama
print("number of duplicate rows: ", duplicate_rows_df.shape) # menampilkan nya dalam bentuk shape

number of duplicate rows:  (0, 5)

In [35]:
df.count() # melihat isi atribute dari setiap rows

merek    7
model    7
tahun    7
harga    6
HP       7
dtype: int64

In [36]:
df = df.drop_duplicates() # menghapus yang duplicate
df.head(6) # menampilkan

         merek   model  tahun     harga     HP
0          BMW      M1   2011  $50,000    10.0
1          BMW      M2   2015  $70,000    15.0
2  LAMBORGHINI    HEAT   2010  $60,000    15.0
3  LAMBORGHINI  RUMBLE   2015  $80,000    10.0
4  LAMBORGHINI    RONE   2000  $50,000    10.0
5  LAMBORGHINI    RONE   2000  $50,000   100.0

In [37]:
df.count() # melihat hasil dari setiap rows

merek    7
model    7
tahun    7
harga    6
HP       7
dtype: int64

In [38]:
df = df.dropna() # droping the missing value
df.count()

merek    6
model    6
tahun    6
harga    6
HP       6
dtype: int64

In [54]:
f = plt.figure(figsize=(12,4))
f.add_subplot(1,2,1)
df['HP'].plot(kind='kde')
f.add_subplot(1,2,2)
plt.boocplot(df['HP'])
plt.show()

SyntaxError: invalid syntax (4029524027.py, line 5)